In [42]:
import pandas as pd
x=pd.read_csv("anu.csv")
print(x)

     name      marks education  y.o.b
0     Anu  19.234567       NaN   2003
1    Mani  30.234560   diploma   1992
2    Pari  21.234560       bsc   2000
3  Suresh  30.345600       NaN   1991
4   Jessi  10.456700       6th   2012
5    Manu   7.456780       3rd   2015
6     NaN  50.345670       8th   1880
7    jhon  12.346000       NaN   2010
8    jack  45.345670    m.tech   1885

In [43]:
x.dropna()

    name     marks education  y.o.b
1   Mani  30.23456   diploma   1992
2   Pari  21.23456       bsc   2000
4  Jessi  10.45670       6th   2012
5   Manu   7.45678       3rd   2015
8   jack  45.34567    m.tech   1885

In [44]:
x.dtypes

name          object
marks        float64
education     object
y.o.b          int64
dtype: object

In [45]:
x["name"]=x["name"].astype("string")
x.dtypes

name          string
marks        float64
education     object
y.o.b          int64
dtype: object

In [46]:
o=x.select_dtypes(include=object).columns.tolist()
x[o]=x[o].astype("string")
x.dtypes

name          string
marks        float64
education     string
y.o.b          int64
dtype: object

In [47]:
x["name"].unique()

<StringArray>
['Anu', 'Mani', 'Pari', 'Suresh', 'Jessi', 'Manu', <NA>, 'jhon', 'jack']
Length: 9, dtype: string

In [48]:
import numpy as np
x["marks"].apply(np.ceil)

0    20.0
1    31.0
2    22.0
3    31.0
4    11.0
5     8.0
6    51.0
7    13.0
8    46.0
Name: marks, dtype: float64

In [49]:
import numpy as np
x["marks"].apply(np.floor)

0    19.0
1    30.0
2    21.0
3    30.0
4    10.0
5     7.0
6    50.0
7    12.0
8    45.0
Name: marks, dtype: float64

In [50]:
print(x.groupby("marks").groups)

{7.45678: [5], 10.4567: [4], 12.346: [7], 19.234567: [0], 21.23456: [2], 30.23456: [1], 30.3456: [3], 45.34567: [8], 50.34567: [6]}